In [ ]:
#En este notebook se une toda la información en una única tabla y se crea la tabla 'balances'

In [1]:
import pandas as pd 
import numpy as np

In [2]:
clientes = pd.read_csv('C:/Users/Pc/Desktop/Máster/Data Science (Pontia)/Proyecto Jupyter/Csv/clientes.csv')

In [3]:
transacciones = pd.read_csv('C:/Users/Pc/Desktop/Máster/Data Science (Pontia)/Proyecto Jupyter/Csv/transacciones.csv')

In [4]:
balances = pd.read_csv('C:/Users/Pc/Desktop/Máster/Data Science (Pontia)/Proyecto Jupyter/Csv/balance.csv')

In [5]:
fraude = pd.read_csv('C:/Users/Pc/Desktop/Máster/Data Science (Pontia)/Proyecto Jupyter/Csv/fraude.csv')

In [6]:
clientes.head()

   t_id    cl_origen   cl_destino
0     0  C1231006815  M1979787155
1     1  C1666544295  M2044282225
2     2  C1305486145   C553264065
3     3   C840083671    C38997010
4     4  C2048537720  M1230701703

In [7]:
transacciones.sample()

            t_id     tipo               tiempo     monto
1377925  1377925  PAYMENT  2022-09-07 00:00:00  38016.86

In [8]:
fraude.sample()

            t_id  es_fraude mensaje_alarma
1113947  1113966          0             No

In [9]:
balances.sample()

             cliente     t_id  balance_prev  balance_post
7919073  M1053910133  2492099           0.0           0.0

In [10]:
len(fraude)

6362520

In [11]:
batman=transacciones.merge(clientes, on='t_id', how='inner')

In [12]:
batman.head()

   t_id      tipo               tiempo     monto    cl_origen   cl_destino
0     0   PAYMENT  2022-09-01 07:00:00   9839.64  C1231006815  M1979787155
1     1   PAYMENT  2022-09-01 07:00:00   1864.28  C1666544295  M2044282225
2     2  TRANSFER  2022-09-01 07:00:00    181.00  C1305486145   C553264065
3     3  CASH_OUT  2022-09-01 07:00:00    181.00   C840083671    C38997010
4     4   PAYMENT  2022-09-01 07:00:00  11668.14  C2048537720  M1230701703

In [13]:
superman=batman.merge(fraude, on='t_id', how='inner')

In [14]:
superman.tail()

,t_id,tipo,tiempo,monto,cl_origen,cl_destino,es_fraude,mensaje_alarma
6362515,6362615,CASH_OUT,2022-10-02 05:00:00,339682.13,C786484425,C776919290,1,No
6362516,6362616,TRANSFER,2022-10-02 05:00:00,6311409.28,C1529008245,C1881841831,1,No
6362517,6362617,CASH_OUT,2022-10-02 05:00:00,6311409.28,C1162922333,C1365125890,1,No
6362518,6362618,TRANSFER,2022-10-02 05:00:00,850002.52,C1685995037,C2080388513,1,No
6362519,6362619,CASH_OUT,2022-10-02 05:00:00,850002.52,C1280323807,C873221189,1,No

In [15]:
len(superman)

6362520

In [16]:
balances.head(5)

       cliente  t_id  balance_prev  balance_post
0  C1231006815     0      170136.0     160296.36
1  M1979787155     0           0.0          0.00
2  C1666544295     1       21249.0      19384.72
3  M2044282225     1           0.0          0.00
4  C1305486145     2         181.0          0.00

In [17]:
# Comprobar si hay filas en que coincidan cliente origen y destino
superman[superman['cl_origen']==superman['cl_destino']]

Empty DataFrame
Columns: [t_id, tipo, tiempo, monto, cl_origen, cl_destino, es_fraude, mensaje_alarma]
Index: []

In [18]:
balances=balances.rename(columns={"cliente": "cl_origen"})
df= superman.merge(balances, how='inner', on=['cl_origen','t_id'])

In [19]:
df.head()

,t_id,tipo,tiempo,monto,cl_origen,cl_destino,es_fraude,mensaje_alarma,balance_prev,balance_post
0,0,PAYMENT,2022-09-01 07:00:00,9839.64,C1231006815,M1979787155,0,No,170136.0,160296.36
1,1,PAYMENT,2022-09-01 07:00:00,1864.28,C1666544295,M2044282225,0,No,21249.0,19384.72
2,2,TRANSFER,2022-09-01 07:00:00,181.00,C1305486145,C553264065,1,No,181.0,0.00
3,3,CASH_OUT,2022-09-01 07:00:00,181.00,C840083671,C38997010,1,No,181.0,0.00
4,4,PAYMENT,2022-09-01 07:00:00,11668.14,C2048537720,M1230701703,0,No,41554.0,29885.86

In [20]:
len(df)

6362520

In [21]:
balances=balances.rename(columns={"cl_origen": "cl_destino"})
df2= df.merge(balances, how='inner', on=['cl_destino','t_id'])

In [22]:
df2.head()

,t_id,tipo,tiempo,monto,cl_origen,cl_destino,es_fraude,mensaje_alarma,balance_prev_x,balance_post_x,balance_prev_y,balance_post_y
0,0,PAYMENT,2022-09-01 07:00:00,9839.64,C1231006815,M1979787155,0,No,170136.0,160296.36,0.0,0.0
1,1,PAYMENT,2022-09-01 07:00:00,1864.28,C1666544295,M2044282225,0,No,21249.0,19384.72,0.0,0.0
2,2,TRANSFER,2022-09-01 07:00:00,181.00,C1305486145,C553264065,1,No,181.0,0.00,0.0,0.0
3,3,CASH_OUT,2022-09-01 07:00:00,181.00,C840083671,C38997010,1,No,181.0,0.00,21182.0,0.0
4,4,PAYMENT,2022-09-01 07:00:00,11668.14,C2048537720,M1230701703,0,No,41554.0,29885.86,0.0,0.0

In [23]:
len(df2)

6362520

In [24]:
df2=df2.rename(columns={"balance_prev_x": "balance_prev_or", "balance_post_x": "balance_post_or", "balance_prev_y": "balance_prev_des", "balance_post_y": "balance_post_des"})

In [25]:
df2.head()

,t_id,tipo,tiempo,monto,cl_origen,cl_destino,es_fraude,mensaje_alarma,balance_prev_or,balance_post_or,balance_prev_des,balance_post_des
0,0,PAYMENT,2022-09-01 07:00:00,9839.64,C1231006815,M1979787155,0,No,170136.0,160296.36,0.0,0.0
1,1,PAYMENT,2022-09-01 07:00:00,1864.28,C1666544295,M2044282225,0,No,21249.0,19384.72,0.0,0.0
2,2,TRANSFER,2022-09-01 07:00:00,181.00,C1305486145,C553264065,1,No,181.0,0.00,0.0,0.0
3,3,CASH_OUT,2022-09-01 07:00:00,181.00,C840083671,C38997010,1,No,181.0,0.00,21182.0,0.0
4,4,PAYMENT,2022-09-01 07:00:00,11668.14,C2048537720,M1230701703,0,No,41554.0,29885.86,0.0,0.0

In [ ]:
# Guardamos la tabla completa en un  nuevo csv llamado 'dec_fraude'
df2.to_csv('C:/Users/Pc/Desktop/Máster/Data Science (Pontia)/Proyecto Jupyter/Csv/dec_fraude.csv', index=False)

In [27]:
balances=df2.drop(['tipo','tiempo','monto','cl_origen','cl_destino', 'es_fraude','mensaje_alarma'], axis=1, inplace=True)

In [28]:
df2.head()

   t_id  balance_prev_or  balance_post_or  balance_prev_des  balance_post_des
0     0         170136.0        160296.36               0.0               0.0
1     1          21249.0         19384.72               0.0               0.0
2     2            181.0             0.00               0.0               0.0
3     3            181.0             0.00           21182.0               0.0
4     4          41554.0         29885.86               0.0               0.0

In [29]:
df2.tail()

,t_id,balance_prev_or,balance_post_or,balance_prev_des,balance_post_des
6362515,6362615,339682.13,0.0,0.00,339682.13
6362516,6362616,6311409.28,0.0,0.00,0.00
6362517,6362617,6311409.28,0.0,68488.84,6379898.11
6362518,6362618,850002.52,0.0,0.00,0.00
6362519,6362619,850002.52,0.0,6510099.11,7360101.63

In [30]:
len(df2)

6362520

In [35]:
df2.to_csv('C:/Users/Pc/Desktop/Máster/Data Science (Pontia)/Proyecto Jupyter/Csv/balances.csv', index=False)